Repository: FriendsOfTYPO3/extension_builder
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: da, de

# error.extension.0
source: An extension key must have minimum 3, maximum 30 characters (not counting underscores)
da: En udvidelsesnøgle skal have minimum tre og maksimum 30 karakterer (understreg tæller ikke med)
de: Ein Extensionkey muss mindestens 3 und darf maximal 30 Zeichen lang sein (Unterstriche werden nicht berücksichtigt)

# error.extension.1
source: Illegal character(s) in extension key. Allowed characters are: a-z (lowercase), 0-9 and '_' (underscore)
da: Illegale karakter(er) i udvidelsesnøgle. Tilladte karakterer er: a-z (små bogstaver), 0-9 og '_' (understreg)
de: Unzulässige(s) Zeichen im Extensionkey. Erlaubte Zeichen sind: a-z (Kleinbuchstaben), 0-9 und '_' (Unterstrich)

# error.extension.2
source: The key may not begin with one of the following prefixes: tx,u,user_,pages,tt_,sys_,ts_language_,csh_
da: Nøglen må ikke begynde med en af følgende præfiks: tx,u,user_,pages,tt_,sys_,ts_language_,csh_

# error.extension.3
source: Extension keys cannot start or end with 0-9 and '_' (underscore)
da: Udvidelsesnøgler kan ikke starte eller slutte med 0-9 og '_' (understreg)
de: Der Extensionkey darf nicht mit 0-9 und '_' (Unterstrich) beginnen oder enden

# error.extension.500
source: There is an existing piBased extension with this extension key. Please choose another extension key or rename the existing extension directory
da: Dette er en eksisterende piBaseret udvidelse med denne udvidelsesnøgle. Vælg venligst en anden udvidelses nøgle eller omdøb den eksisterende udvidelsesmappe

source: Name
da: Navn

source: Key
da: Nøgle

source: Extension title
da: Udvidelsestitel

source: Extension Key
da: Udvidelses-nøgle

# descr_extensionKey
source: The extensionkey should be lowercase and without spaces. It will be the unique identifier for this extension.
da: Udvidelsesnøglen skal være med små bogstaver og uden mellemrum. Det vil blive det unikke datanavn for denne udvidelse.
de: Der Extensionkey sollte nur Kleinbuchstaben enthalten und ohne Leerzeichen sein. Er wird der eindeutige Bezeichner für diese Erweiterung sein.

source: Vendor name
da: Vendor-navn

# descr_vendorName
source: The vendor name is the first part of the new package identifier
da: Vendor-navnet er den første del af datanavnet i den nye pakke

# short_description
source: Description
da: Beskrivelse

source: Description
da: Beskrivelse

source: Target version
da: Målversion

# descr_target_version
source: Select the TYPO3 version the extension requires.
da: Vælg den TYPO3-version som kræves af udvidelsen.

source: State
da: Tilstand

source: Alpha
da: Alfa

source: Stable
da: Stabil

source: Experimental
da: Eksperimentel

source: Category
da: Kategori

# custom_category
source: OR custom
da: ELLER tilpasset

# descr_custom_category
source: You can define an own category here
da: Du kan definere din egen kategori her

# descr_category
source: The category this extension belongs to in the extension manager.
da: Den kategori som denne udvidelse tilhører i udvidelses-manageren.

# misc
source: Miscellaneous
da: Diverse

source: Services
da: Tjenester

source: Templates
da: Skabeloner

source: Examples
da: Eksempler

source: Distribution
da: Fordeling

source: Documentation
da: Dokumentation

source: Disable versioning
da: Deaktivér versionering
de: Versionierung deaktivieren

# descr_disableVersioning
source: Check this if your extension needs no support for versioning. This will skip the creation of versioning related columns in the database
da: Vælg dette hvis din udvidelse ikke behøver versionerings-understøttelse. Det vil droppe oprettelse af den versioneringsrelaterede kolonne i databasen
de: Aktivieren Sie diese Option, wenn Ihre Erweiterung keine Unterstützung für die Versionierung/Workspaces benötigt. Damit wird die Erstellung von dafür benötigten Spalten in der Datenbank übersprungen.

source: Disable localization
da: Deaktivér sprogunderstøttelse

# descr_disableLocalization
source: Check this if your extension needs no support for localization. This will skip the creation of localization related columns in the database
da: Vælg dette hvis din udvidelse ikke understøtter sprogversionering. Dette vil droppe oprettelse af den relaterede kolonne for sprogunderstøttelse i databasen

# generateDocumentationTemplate
source: Generate documentation
da: Generér dokumentation

# descr_generateDocumentationTemplate
source: Check this if you want a documentation generated for your extension.
da: Vælg dette hvis du ønsker at der oprettes dokumentation til din udvidelse.

# generateEditorConfig
source: Generate editorconfig file
da: Generér editorconfig fil
de: Editorconfig Datei erzeugen

# descr_generateEditorConfig
source: Check this if you want a generated editorconfig file for your extension.
da: Markér dette hvis du ønsker en genereret editorconfig fil til din udvidelse.
de: Aktivieren Sie diese Option, wenn Sie eine generierte Editorkonfigurationsdatei für Ihre Erweiterung wünschen.

source: Generate empty git repository
da: Generér tomt git repository

# descr_generateEmptyGitRepository
source: Check this if you want to generate an empty git repository for your extension and want to publish it later on.
da: Markér dette hvis du vil generere et tomt git repository til din udvidelse og ønsker at offentliggøre det senere.

# sourceLanguage
source: Source language for xliff files
da: Kildesprog for xliff-filer
de: Quellsprache für xliff Dateien

# descr_sourceLanguage
source: The source language for xliff files is the 2 letter language code in which the "source" of a label is defined. In general it should be "en" for English. This label can later be translated into other languages.
da: Kildesproget for xliff filer er den to-bogstavs sprogkode, hvor "kilden" til en etiket er defineret. Generelt skulle det være "en" for engelsk. Denne etiket kan senere oversættes til andre sprog.
de: Die Ausgangssprache für xliff Dateien ist der zweistellige Sprachcode, in dem die "Quelle" eines Labels definiert ist. Im Allgemeinen sollte es für Englisch „en“ sein. Dieses Label kann später in andere Sprachen übersetzt werden.

source: Depends on
da: Afhænger af

# descr_dependsOn
source: If the extension is depending on other extensions, enter the extension keys here (one per line followed by a double arrow and the lowest version number).
da: Hvis udvidelsen afhænger af andre udvidelser, indtastes udvidelsesnøglen her (en pr. linje efterfulgt af dobbelt pil og det laveste versionsnummer).
de: Wenn diese Erweiterung von anderen Erweiterungen abhängig ist, fülle die Erweiterungsschlüssel hier ein (einen pro Zeile gefolgt von einem Doppelpfeil und der niedrigsten Versionsnummer).

# persons
source: Extension authors
da: Udvidelses-forfattere

source: Role
da: Rolle

source: Developer
da: Udvikler

source: Product manager
da: Produktleder

source: Company
da: Firma

# descr_plugins
source: The frontend plugins which have to be registered in the extension
da: Frontend plugins som er nødvendige i denne udvidelse
de: Die Frontend-Plugins, die in der Erweiterung registriert werden müssen

source: Controller action combinations
da: Controller handling kombinationer

# descr_controller_action_combinations
source: Here you can configure, which controller action combinations this plugin/module should have. Example: <br />Blog => list,show <br />(one controller per line, actions comma separated) <br />If you leave this empty, all available actions are configured for this plugin.
da: Her kan du konfigurere hvilken controller handlings kombinationer som denne plugin/modul skal have. Eksempel: <br />Blog => liste,vis <br />(en controller pr linje, handlinger komma separeret) <br />Hvis du efterlader det tomt, vil alle tilgængelige handlinger blive konfigureret for denne plugin.
de: Hier können Sie einstellen, welche Controller-Aktionskombinationen dieses Plugin/Modul haben soll. Beispiel: <br />Blog => list,show <br />(ein Controller pro Zeile, Actions kommasepariert) <br /> Wenn Sie dieses Feld leer lassen, sind alle verfügbaren Aktionen für dieses Plugin konfiguriert.

source: Non cacheable actions
da: Ingen mulige cache handlinger
de: Nicht zwischenspeicherbare Actions

# descr_noncacheable_actions
source: Typically create, delete and update actions should not be cached. (Same format as above)
da: Normale opret-, og opdater-handlinger bør ikke blive cached. (Samme format som herover)

source: Backend modules
da: Backend-moduler

source: Main module
da: Hovedmodul

# uniqueInThisModel
source: Should be unique for this model
da: Skal være unik for denne model

source: More
da: Mere

source: More options
da: Flere valg

source: advanced options
da: avancerede valgmuligheder

source: Remove
da: Fjern

source: Add
da: Tilføj

source: Render type
da: Renderingstype
de: Rendering-Methode

# desc_renderType
source: How should the relation be displayed in backend forms?
da: Hvordan skal relationen vises i Backend formularer?

# selectSingleBox
source: Dropdown (multiple)
da: Dropdown (flere)
de: Dropdown (Mehrfachauswahl)

# selectCheckBox
source: Checkboxes
da: Afkrydsningsfelter
de: Checkboxen

# selectMultipleSideBySide
source: Side by side multi select
da: Side ved side multivalg

source: Is nullable?
da: Kan være tomt?
de: Kann NULL sein?

# descr_isNullable
source: If set to true, this field can be null
da: Hvis valgt, kan dette felt være tomt
de: Wenn auf "true" gesetzt, kann dieses Feld NULL sein

source: Is exclude field?
da: Er ekskluderet felt?

# descr_isExcludeField
source: If set to true, this field will only be visible for admin users per default
da: Hvis sat til sand, vil feltet kun være synligt for admin-brugere som standard
de: Wenn auf "true" gesetzt, wird dieses Feld standardmäßig nur für Admin-Benutzer sichtbar sein

source: Is l10n_mode = exclude?
da: Er l10n_mode = ekskludér?

# descr_isL10nModeExclude
source: If set to true, this field will be set to l10n_mode = exclude
da: Hvis sat til sand, vil dette felt blive sat til l10n_mode = ekskludér

source: New model object
da: Nyt modelobjekt
de: Neues Modellkobjekt

source: Domain object settings
da: Domæneobjekt indstillinger

source: Object type
da: Objekttype

# descr_objectType
source: Value objects are simple objects that are defined by their value and have no 'identity'
da: Værdiobjekter er simple objekter som er defineret af deres værdi og har ingen 'identitet'

source: Entity
da: Enhed

source: Value object
da: Værdiobjekt

source: Is aggregate root?
da: Er aggregat root?
de: Ist Aggregatwurzel?

# descr_isAggregateRoot
source: If true, the Extension Builder will generate a repository for this model
da: Hvis sand, vil Extension Builder oprette et repository for denne model

source: Enable sorting?
da: Aktivér sortering?

# descr_enableSorting
source: If true, sorting in the backend is enabled
da: Hvis sand vil sortering i Backend være aktiveret

source: Add deleted field
da: Tilføj slettet felt

# descr_addDeletedField
source: Deleting a record with "delete" field will not really delete the record, but just set the delete flag to true
da: Sletning af element med "slet" felt vil ikke i virkeligheden slette elementet, men blot sætte slet-flaget til sand

source: Add hidden field
da: Tilføj skjult felt

# descr_addHiddenField
source: The hidden field is an "enable" field. Only records which are not hidden will be displayed
da: Det skjulte felt er et "aktiver" felt. Kun elementet som ikke er skjult, vil blive vist

source: Add starttime/endtime fields
da: Tilføj starttid/sluttids felter

# descr_addStarttimeEndtimeFields
source: If set, the related records will have a startime and endtime as "enable" field
da: Hvis angivet vil relaterede elementer have en starttid og en sluttid som "aktiver" felt

# enableCategorizable
source: Enable categorization?
da: Aktivér kategorisering?

# descr_enableCategorizable
source: If true, categorization in the backend is enabled for this model
da: Hvis sand er kategorisering i Backend aktiveret i denne model

# mapToTable
source: Map to existing table
da: Knyt til eksisterende tabel

# descr_mapToTable
source: If the model should extend an existing table, you can configure this here
da: Hvis modellen skal udvide en eksisterende tabel, kan du konfigurere det her

# parentClass
source: Extend existing model class
da: Udvid eksisterende modelklasse

# descr_parentClass
source: If this model should extend an existing other model, name it here
da: Hvis denne model skal udvide en anden eksisterende model, navngiv den her

source: Default actions
da: Standardhandlinger

source: Action type
da: Handlingstype

# descr_actionType
source: For each selected action, the Extension Builder will generate a template and a action method in the controller of this model. If the model is an aggregate root the default CRUD actions will be generated per default.
da: For hver valgte handling, opretter Extension Builder en skabelon og en handling i controlleren af modellen. Hvis modellen er en aggregeret root vil standard CRUD-handlinger blive oprettet som standard.
de: Für jede ausgewählte Aktion generiert der Erweiterungsgenerator eine Vorlage und eine Aktionsmethode in dem Controller dieses Modells. Wenn das Modell eine Aggregatwurzel ist, werden die Standard-CRUD-Aktionen pro Standard generiert.

source: show
da: vis

source: index
da: indeks

source: list
da: liste

# create_new
source: new/create
da: ny/opret

source: edit/update
da: rediger/opdater

source: delete
da: slet

source: Properties
da: Egenskaber

source: Property name
da: Egenskabens navn

# descr_propertyName
source: The name should be lowerCamelCase and unique in this model
da: Navnet skal være lowerCamelCase og unikt i denne model
de: Der Name sollte lowerCamelCase sein und in diesem Modell einzigartig sein

source: Property type
da: Egenskabens type

# descr_propertyType
source: All types with * are not yet supported by the frontend form generation/validation
da: Alle typer med * understøttes ikke af Frontend formular oprettelse/validering endnu

source: String
da: Streng

source: Text
da: Tekst

source: Rich text*
da: Rig tekst*
de: Richt Text*

source: Integer
da: Heltal

source: Floating point
da: Flydende tal
de: Fließkomma

source: Boolean
da: Boolsk

# dateTime
source: DateTime (timestamp)
da: Datotid (timestamp)
de: Datum mit Uhrzeit (timestamp)

# date
source: Date (timestamp)
da: Dato (timestamp)
de: Datum (timestamp)

# nativeDateTime
source: DateTime
da: Datotid

# nativeDate
source: Date
da: Dato

# time
source: Time (timestamp)*
da: Tidspunkt (timestamp)*

source: Time*
da: Tid*

source: Time/Sec*
da: Tid/sek*

source: Select list
da: Vælg liste

source: File*
da: Fil*

source: Image*
da: Billede*

source: File reference*
da: Fil reference*

source: Folder*
da: Mappe*

source: Password
da: Adgangskode

source: Slug
da: URL-segment
de: URL-Segment

source: Color Picker
da: Farvevælger

source: Pass through
da: Gå igennem

source: None
da: Ingen

source: Allowed file types
da: Tilladte filtyper

# descr_allowedFileTypes
source: Comma separated file endings like: doc,ods
da: Kommaseparerede filendelser som: doc,ods
de: Komma getrennte Dateienendungen wie: doc,ods

# maxItems
source: Allowed number of files
da: Tilladte antal filer

source: Is required?
da: Er påkrævet?

source: Relations
da: Relationer

# relationName
source: Name
da: Navn

# descr_relationName
source: The name should be lowerCamelCase and unique in this model
da: Navnet skal være lowerCamelCase og unikt i denne model
de: Der Name sollte lowerCamelCase sein und in diesem Modell einzigartig sein

source: Extension properties
da: Udvidelsens egenskaber
de: Extensioneigenschaften

source: Tab label
da: Kolonne-etiket

source: Lazy loading
da: Langsom indlæsning

# descr_lazyLoading
source: Make this relation lazy loading
da: Lav langsom indlæsning på denne relation

# foreignRelationClass
source: Relation to external class
da: Relation til ekstern klasse

# descr_foreignRelationClass
source: If this is a relation to an external model, enter the (full qualified) class name here. The class must exist and be loadable
da: Hvis dette er en relation til en eksternt model indtastes det (hele kvalificerede) class navn her. class skal eksistere og være indlæst

# modeler_invalidConfigurationTitle
source: Invalid configuration!
da: Ugyldig konfiguration!

# modeler_invalidExtensionPropertiesTitle
source: Invalid extension properties
da: Ugyldig udvidelses-egenskab

# modeler_invalidExtensionProperties
source: Please check the fields in the left panel
da: Tjek venligst felterne i venstre panel

# modeler_duplicatePropertyNamesTitle
source: Duplicate property names
da: Dubleret egenskabsnavn

# modeler_missingModelName
source: Please enter a model name!
da: Angiv venligst modelnavn!

# modeler_duplicateModelNamesTitle
source: Duplicate model names
da: Dubleret modelnavn

# modeler_invalidModelConfiguration
source: Invalid fields in model:
da: Ugyldigt felt i model:

# modeler_extensionSaveError
source: Extension could not be saved:
da: Udvidelse kunne ikke gemmes:

# modeler_loadPipeConfirmMessage
source: Do you really want to clear the current working board and load the selected pipe? Unsaved changes will get lost!
da: Vil du virkelige rydde det aktuelle arbejdsbord og indlæse den valgte side? Ændringer der ikke er gemt, vil gå tabt!
